
//1. 개, 고양이, 너굴맨 으로 문자열 배열 만들기
var a = new Array();
a=["개","고양이","너굴맨"];


//2. 변수 선언 하나 하고 여기에 배열에서 고양이랑 개 꺼내고 둘을 더하기
var b = a[0]+a[1];

//3. alert 함수로 찍기
alert(b);



// // 1. 개, 고양이, 너굴맨 으로 문자열 배열 만들기			
// var a = Array("개","고양이","너굴맨");

// // 2. 변수 선언 하나 하고 여기에 배열에서 고양이랑 개 꺼내고 둘을 더하기				
// var b = a[1] + a[0];

// // 3. alert 함수로 찍기
// alert("합계: "+b);

// var numbers = [1,2,3,4]; // 0 1 2 3 
// var sum;

// var n1=numbers[1];
// var n2=numbers[3];

// sum = n1 + n2;
// // // 2.일반 변수 선언하고 2와 4를 배열값 꺼내서 더해서 변수에 넣기
// // var n1=a[1];
// // var n2=a[3];
// // var sum = n1 + n2;


// alert(sum); // 6