// 이거 주석임. 한줄 주석.

/*
    참고: 여러줄 주석은 이렇게
*/

// <script src="a.js"> </script> 에 의해
// 프로그램 해석기가 여기로 와서 아래로 한줄 한줄 읽으면서
// 처리하게 됨.

// alert 함수라고 하고 얘는 팝업을 띄워줌.
// ( 안에 쓴 내용을 찍음)
//명령문. 문. 마지막에 마침표를 찍어야함. ; 이 js의 명령문의 마침표임.   

/*
alert("헬로월드!!!");   
alert(1000);   
alert(1+7);   

*/

alert("헬로월드!!!");   
alert(1000);   
alert(1+7);   

// confirm("바보세요?");
// 확인,취소가 나오는 팝업창

// prompt("입력처리창 팝업");
// 입력창 팝업 생성

// document.write("가나다라마바사");
// document.write( "<h1>헬로 월드</h1>" );
// 브라우저에 직렬 출력
// 바로 나타나지는 않음

// console.log( "헬로 월드" );
// // 콘솔에서 출력되는 메시지


// var cat = 1;
// var dog = 2+0;
// var a = 1, b = 2;   // 동시에 여러 데이터 인식 가능
// alert(dog);

// var sum= cat+dog;
// alert(sum);
// // 변수 선언, 데이터를 담는 박스 
